endresshauser-lp/zephyr/drivers/mspi/mspi_stm32_xspi_psram.c
/*
 * Copyright (c) 2025 EXALT Technologies.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/*
 *
 * MSPI flash controller driver for stm32 series with multi-SPI peripherals
 * This driver is based on the stm32Cube HAL XSPI driver
 *
 */

#define DT_DRV_COMPAT st_stm32_xspi_psram_controller

#include <zephyr/drivers/pinctrl.h>
#include <zephyr/drivers/clock_control/stm32_clock_control.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/flash.h>
#include <zephyr/drivers/mspi.h>
#include <zephyr/logging/log.h>
#include <zephyr/drivers/dma/dma_stm32.h>
#include <zephyr/drivers/dma.h>
#include <stm32_ll_dma.h>
#include <zephyr/pm/device.h>
#include <zephyr/pm/device_runtime.h>
#include <zephyr/pm/policy.h>
#include <zephyr/irq.h>
#include <stm32_bitops.h>
#include "mspi_stm32.h"

LOG_MODULE_REGISTER(mspi_stm32_xspi_psram, CONFIG_MSPI_LOG_LEVEL);

struct mspi_stm_xspi_psram_config {
    struct mspi_stm32_conf mspi_cfg;
    uint8_t polling_cmd;
    uint8_t polling_mask;
};

static uint32_t mspi_stm32_xspi_psram_hal_address_size(uint8_t address_length)
{
	if (address_length == 4U) {
		return HAL_XSPI_ADDRESS_32_BITS;
	}

	return HAL_XSPI_ADDRESS_24_BITS;
}

/**
 * @brief Gives XSPI_RegularCmdTypeDef with all parameters set except Instruction, Address, NbData
 */
static XSPI_RegularCmdTypeDef mspi_stm32_xspi_psram_prepare_cmd(uint8_t cfg_mode, uint8_t cfg_rate)
{
	/* Command empty structure */
	XSPI_RegularCmdTypeDef cmd_tmp = {0};

	cmd_tmp.OperationType = HAL_XSPI_OPTYPE_COMMON_CFG;
	cmd_tmp.InstructionWidth = (cfg_mode == MSPI_IO_MODE_OCTAL) ? HAL_XSPI_INSTRUCTION_16_BITS
								    : HAL_XSPI_INSTRUCTION_8_BITS;
	cmd_tmp.InstructionDTRMode = (cfg_rate != MSPI_DATA_RATE_SINGLE)
					     ? HAL_XSPI_INSTRUCTION_DTR_ENABLE
					     : HAL_XSPI_INSTRUCTION_DTR_DISABLE;
	cmd_tmp.AlternateBytesMode = HAL_XSPI_ALT_BYTES_NONE;
	cmd_tmp.AddressDTRMode = (cfg_rate != MSPI_DATA_RATE_SINGLE) ? HAL_XSPI_ADDRESS_DTR_ENABLE
								   : HAL_XSPI_ADDRESS_DTR_DISABLE;
	cmd_tmp.DataDTRMode = (cfg_rate != MSPI_DATA_RATE_SINGLE) ? HAL_XSPI_DATA_DTR_ENABLE
								: HAL_XSPI_DATA_DTR_DISABLE;
	/* AddressWidth must be set to 32bits for init and mem config phase */
	cmd_tmp.AddressWidth = HAL_XSPI_ADDRESS_32_BITS;
	cmd_tmp.DataDTRMode = (cfg_rate != MSPI_DATA_RATE_SINGLE) ? HAL_XSPI_DATA_DTR_ENABLE
								: HAL_XSPI_DATA_DTR_DISABLE;
	cmd_tmp.DQSMode =
		(cfg_rate != MSPI_DATA_RATE_SINGLE) ? HAL_XSPI_DQS_ENABLE : HAL_XSPI_DQS_DISABLE;
	cmd_tmp.SIOOMode = HAL_XSPI_SIOO_INST_EVERY_CMD;

	switch (cfg_mode) {
	case MSPI_IO_MODE_OCTAL:
		cmd_tmp.InstructionMode = HAL_XSPI_INSTRUCTION_8_LINES;
		cmd_tmp.AddressMode = HAL_XSPI_ADDRESS_8_LINES;
		cmd_tmp.DataMode = HAL_XSPI_DATA_8_LINES;
		break;

	case MSPI_IO_MODE_QUAD:
		cmd_tmp.InstructionMode = HAL_XSPI_INSTRUCTION_4_LINES;
		cmd_tmp.AddressMode = HAL_XSPI_ADDRESS_4_LINES;
		cmd_tmp.DataMode = HAL_XSPI_DATA_4_LINES;
		break;

	case MSPI_IO_MODE_DUAL:
		cmd_tmp.InstructionMode = HAL_XSPI_INSTRUCTION_2_LINES;
		cmd_tmp.AddressMode = HAL_XSPI_ADDRESS_2_LINES;
		cmd_tmp.DataMode = HAL_XSPI_DATA_2_LINES;
		break;

	default:
		cmd_tmp.InstructionMode = HAL_XSPI_INSTRUCTION_1_LINE;
		cmd_tmp.AddressMode = HAL_XSPI_ADDRESS_1_LINE;
		cmd_tmp.DataMode = HAL_XSPI_DATA_1_LINE;
		break;
	}

	return cmd_tmp;
}

/**
 * @brief Checks if the flash is currently operating in memory-mapped mode.
 */
static bool mspi_stm32_xspi_psram_is_memorymap(const struct device *dev)
{
	struct mspi_stm32_data *dev_data = dev->data;

	return stm32_reg_read_bits(&dev_data->hmspi.xspi.Instance->CR, XSPI_CR_FMODE) ==
	       XSPI_CR_FMODE;
}

/**
 * @brief Sets the device back in indirect mode.
 */
static int mspi_stm32_xspi_psram_memmap_off(const struct device *controller)
{
	struct mspi_stm32_data *dev_data = controller->data;

	if (HAL_XSPI_Abort(&dev_data->hmspi.xspi) != HAL_OK) {
		LOG_ERR("MemMapped abort failed: %x", dev_data->hmspi.xspi.ErrorCode);
		return -EIO;
	}
	return 0;
}

/**
 * @brief Sets the device in Memory-Mapped mode.
 */
static int mspi_stm32_xspi_psram_memmap_on(const struct device *controller)
{
	HAL_StatusTypeDef ret;
	struct mspi_stm32_data *dev_data = controller->data;
	XSPI_MemoryMappedTypeDef s_MemMappedCfg;

	if (mspi_stm32_xspi_psram_is_memorymap(controller)) {
		return 0;
	}

	/* Configure in MemoryMapped mode */
	if ((dev_data->dev_cfg.io_mode == MSPI_IO_MODE_SINGLE) &&
	    (mspi_stm32_xspi_psram_hal_address_size(dev_data->dev_cfg.addr_length) ==
	     HAL_XSPI_ADDRESS_24_BITS)) {
		/* OPI mode and 3-bytes address size not supported by memory */
		LOG_ERR("MSPI_IO_MODE_SINGLE in 3Bytes addressing is not supported");
		return -EIO;
	}

	XSPI_RegularCmdTypeDef s_command =
		mspi_stm32_xspi_psram_prepare_cmd(dev_data->dev_cfg.io_mode, dev_data->dev_cfg.data_rate);

	/* Initialize the read command */
	s_command.OperationType = HAL_XSPI_OPTYPE_READ_CFG;
	s_command.InstructionMode = (dev_data->dev_cfg.data_rate == MSPI_DATA_RATE_SINGLE)
					    ? ((dev_data->dev_cfg.io_mode == MSPI_IO_MODE_SINGLE)
						       ? HAL_XSPI_INSTRUCTION_1_LINE
						       : HAL_XSPI_INSTRUCTION_8_LINES)
					    : HAL_XSPI_INSTRUCTION_8_LINES;
	s_command.InstructionDTRMode = (dev_data->dev_cfg.data_rate == MSPI_DATA_RATE_SINGLE)
					       ? HAL_XSPI_INSTRUCTION_DTR_DISABLE
					       : HAL_XSPI_INSTRUCTION_DTR_ENABLE;
	s_command.InstructionWidth = (dev_data->dev_cfg.data_rate == MSPI_DATA_RATE_SINGLE)
					     ? ((dev_data->dev_cfg.io_mode == MSPI_IO_MODE_SINGLE)
							? HAL_XSPI_INSTRUCTION_8_BITS
							: HAL_XSPI_INSTRUCTION_16_BITS)
					     : HAL_XSPI_INSTRUCTION_16_BITS;
	s_command.Instruction = dev_data->dev_cfg.read_cmd;
	s_command.AddressMode = (dev_data->dev_cfg.data_rate == MSPI_DATA_RATE_SINGLE)
					? ((dev_data->dev_cfg.io_mode == MSPI_IO_MODE_SINGLE)
						   ? HAL_XSPI_ADDRESS_1_LINE
						   : HAL_XSPI_ADDRESS_8_LINES)
					: HAL_XSPI_ADDRESS_8_LINES;
	s_command.AddressDTRMode = (dev_data->dev_cfg.data_rate == MSPI_DATA_RATE_SINGLE)
					   ? HAL_XSPI_ADDRESS_DTR_DISABLE
					   : HAL_XSPI_ADDRESS_DTR_ENABLE;
	s_command.AddressWidth = mspi_stm32_xspi_psram_hal_address_size(dev_data->dev_cfg.addr_length);
	s_command.DataMode = (dev_data->dev_cfg.data_rate == MSPI_DATA_RATE_SINGLE)
				     ? ((dev_data->dev_cfg.io_mode == MSPI_IO_MODE_SINGLE)
						? HAL_XSPI_DATA_1_LINE
						: HAL_XSPI_DATA_8_LINES)
				     : HAL_XSPI_DATA_8_LINES;
	s_command.DataDTRMode = (dev_data->dev_cfg.data_rate == MSPI_DATA_RATE_SINGLE)
					? HAL_XSPI_DATA_DTR_DISABLE
					: HAL_XSPI_DATA_DTR_ENABLE;
	s_command.DummyCycles = dev_data->dev_cfg.rx_dummy;
	s_command.DQSMode = (dev_data->dev_cfg.data_rate == MSPI_DATA_RATE_SINGLE)
				    ? HAL_XSPI_DQS_DISABLE
				    : HAL_XSPI_DQS_ENABLE;

