endresshauser-lp/zephyr/drivers/mspi/mspi_stm32_xspi_psram.c
	s_command.SIOOMode = HAL_XSPI_SIOO_INST_EVERY_CMD;

	ret = HAL_XSPI_Command(&dev_data->hmspi.xspi, &s_command, HAL_XSPI_TIMEOUT_DEFAULT_VALUE);
	if (ret != HAL_OK) {
		LOG_ERR("Failed to set memory mapped mode");
		return -EIO;
	}

	/* Initializes the program command */
	s_command.OperationType = HAL_XSPI_OPTYPE_WRITE_CFG;
    s_command.Instruction = dev_data->dev_cfg.write_cmd;
	s_command.DummyCycles = dev_data->dev_cfg.tx_dummy;

	ret = HAL_XSPI_Command(&dev_data->hmspi.xspi, &s_command, HAL_XSPI_TIMEOUT_DEFAULT_VALUE);
	if (ret != HAL_OK) {
		LOG_ERR("Failed to set memory mapped mode");
		return -EIO;
	}

#ifdef XSPI_CR_NOPREF
	s_MemMappedCfg.NoPrefetchData = HAL_XSPI_AUTOMATIC_PREFETCH_ENABLE;
#ifdef XSPI_CR_NOPREF_AXI
	s_MemMappedCfg.NoPrefetchAXI = HAL_XSPI_AXI_PREFETCH_DISABLE;
#endif /* XSPI_CR_NOPREF_AXI */
#endif /* XSPI_CR_NOPREF */

	/* Enables the memory-mapping */
	s_MemMappedCfg.TimeOutActivation = HAL_XSPI_TIMEOUT_COUNTER_DISABLE;
	ret = HAL_XSPI_MemoryMapped(&dev_data->hmspi.xspi, &s_MemMappedCfg);
	if (ret != HAL_OK) {
		LOG_ERR("Failed to enable memory mapped mode");
		return -EIO;
	}

	return 0;
}

static int mspi_stm32_xspi_psram_context_lock(struct mspi_stm32_context *ctx,
					const struct mspi_xfer *xfer)
{
	if (k_sem_take(&ctx->lock, K_MSEC(xfer->timeout)) < 0) {
		return -EBUSY;
	}

	ctx->xfer = *xfer;
	ctx->packets_left = ctx->xfer.num_packet;
	return 0;
}

static void mspi_stm32_xspi_psram_context_unlock(struct mspi_stm32_context *ctx)
{
	k_sem_give(&ctx->lock);
}

/**
 * Check if the MSPI bus is busy.
 *
 * @param controller MSPI controller device.
 * @return true The MSPI bus is busy.
 * @return false The MSPI bus is idle.
 */
static bool mspi_stm32_xspi_psram_is_inp(const struct device *controller)
{
	struct mspi_stm32_data *dev_data = controller->data;

	return k_sem_count_get(&dev_data->ctx.lock) == 0;
}

static int mspi_stm32_xspi_psram_abort_memmap_if_enabled(const struct device *dev)
{
	int ret = 0;

	if (mspi_stm32_xspi_psram_is_memorymap(dev)) {
		ret = mspi_stm32_xspi_psram_memmap_off(dev);
		if (ret != 0) {
			LOG_ERR("Failed to abort memory-mapped mode.");
			return ret;
		}
	}

	return ret;
}

/**
 * @brief Reads/Writes in memory mapped mode.
 *
 */
static int read_write_in_memory_map_mode(const struct device *dev, struct mspi_xfer_packet *packet)
{
	int ret;
	struct mspi_stm32_data *dev_data = dev->data;

	if (packet->data_buf == NULL) {
		LOG_ERR("data buf is null : 0x%x", packet->cmd);
		return -EIO;
	}

	if (!mspi_stm32_xspi_psram_is_memorymap(dev)) {
		ret = mspi_stm32_xspi_psram_memmap_on(dev);
		if (ret != 0) {
			LOG_ERR("Failed to set memory mapped");
			return ret;
		}
	}

	uintptr_t mmap_addr = dev_data->memmap_base_addr + packet->address;

	if (packet->dir == MSPI_RX) {
		memcpy(packet->data_buf, (void *)mmap_addr, packet->num_bytes);
		k_sleep(K_MSEC(1));
		return 0;
	}

	if (!dev_data->xip_cfg.permission) {
		memcpy((void *)mmap_addr, packet->data_buf, packet->num_bytes);
		k_sleep(K_MSEC(1));
		return 0;
	}

	ret = mspi_stm32_xspi_psram_abort_memmap_if_enabled(dev);
	if (ret != 0) {
		return ret;
	}

	return -EPROTONOSUPPORT;
}

static HAL_StatusTypeDef read_write_in_indirect_mode(const struct device *dev,
						     struct mspi_xfer_packet *packet,
						     uint8_t access_mode)
{
	HAL_StatusTypeDef hal_ret;
	struct mspi_stm32_data *dev_data = dev->data;

	if (packet->dir == MSPI_RX) {
		/* Receive the data */
		switch (access_mode) {
		case MSPI_ACCESS_SYNC:
			hal_ret = HAL_XSPI_Receive(&dev_data->hmspi.xspi, packet->data_buf,
						   HAL_XSPI_TIMEOUT_DEFAULT_VALUE);
			goto end;
		case MSPI_ACCESS_ASYNC:
			hal_ret = HAL_XSPI_Receive_IT(&dev_data->hmspi.xspi, packet->data_buf);
			break;
		case MSPI_ACCESS_DMA:
			uint8_t *dma_buf = k_aligned_alloc(CONFIG_MSPI_STM32_BUFFER_ALIGNMENT,
							   packet->num_bytes);

			if (dma_buf == NULL) {
				LOG_ERR("DMA buffer allocation failed");
				return HAL_ERROR;
			}

			hal_ret = HAL_XSPI_Receive_DMA(&dev_data->hmspi.xspi, dma_buf);
			if (hal_ret == HAL_OK) {
				if (k_sem_take(&dev_data->sync, K_FOREVER) < 0) {
					LOG_ERR("Failed to take sem");
					k_free(dma_buf);
					return HAL_BUSY;
				}
				memcpy(packet->data_buf, dma_buf, packet->num_bytes);
			}

			k_free(dma_buf);
			goto end;
		default:
			/* Not correct */
			hal_ret = HAL_BUSY;
			break;
		}
	} else {
		/* Transmit the data */
		switch (access_mode) {
		case MSPI_ACCESS_SYNC:
			hal_ret = HAL_XSPI_Transmit(&dev_data->hmspi.xspi, packet->data_buf,
						    HAL_XSPI_TIMEOUT_DEFAULT_VALUE);
			goto end;
		case MSPI_ACCESS_ASYNC:
			hal_ret = HAL_XSPI_Transmit_IT(&dev_data->hmspi.xspi, packet->data_buf);
			break;
		case MSPI_ACCESS_DMA:
			hal_ret = HAL_XSPI_Transmit_DMA(&dev_data->hmspi.xspi, packet->data_buf);
			break;
		default:
			/* Not correct */
			hal_ret = HAL_BUSY;
			break;
		}
	}

	if (hal_ret != HAL_OK) {
		goto end;
	}

	/* Lock again expecting the IRQ for end of Tx or Rx */
	if (k_sem_take(&dev_data->sync, K_FOREVER) < 0) {
		LOG_ERR("Failed to take sem");
		return HAL_BUSY;
	}

end:
	if (hal_ret != HAL_OK) {
		LOG_ERR("Failed to access data");
	}

	return hal_ret;
}
/**
 * @brief Sends a Command to the NOR and Receive/Transceive data if relevant in IT or DMA mode.
 *
 */
static int mspi_stm32_xspi_psram_access(const struct device *dev, struct mspi_xfer_packet *packet,
				  uint8_t access_mode)
{
	HAL_StatusTypeDef hal_ret;
	struct mspi_stm32_data *dev_data = dev->data;

	if (dev_data->xip_cfg.enable) {
		if ((packet->cmd == MSPI_NOR_CMD_WREN) || (packet->cmd == MSPI_NOR_OCMD_WREN) ||
		    (packet->cmd == MSPI_NOR_CMD_SE_4B) || (packet->cmd == MSPI_NOR_OCMD_SE) ||
		    (packet->cmd == MSPI_NOR_CMD_SE) ||
		    ((mspi_stm32_xspi_psram_hal_address_size(dev_data->dev_cfg.addr_length) ==
		      HAL_XSPI_ADDRESS_24_BITS) &&
		     (dev_data->dev_cfg.io_mode == MSPI_IO_MODE_SINGLE))) {
			LOG_DBG(" MSPI_IO_MODE_SINGLE in 3Bytes addressing is not supported in "
				"memory map mode, switching to indirect mode");

			int ret = mspi_stm32_xspi_psram_abort_memmap_if_enabled(dev);

			if (ret != 0) {
				return ret;
			}
			goto indirect;
		}

		if (read_write_in_memory_map_mode(dev, packet) == -EPROTONOSUPPORT) {
			goto indirect;
		}
		return 0;
	}

indirect:
	(void)pm_device_runtime_get(dev);
	/* Prevent the clocks to be stopped during the request */
	pm_policy_state_lock_get(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);

