endresshauser-lp/zephyr/drivers/mspi/mspi_stm32_xspi_psram.c
	XSPI_RegularCmdTypeDef cmd =
		mspi_stm32_xspi_psram_prepare_cmd(dev_data->dev_cfg.io_mode, dev_data->dev_cfg.data_rate);

	cmd.DataLength = packet->num_bytes;
	cmd.Instruction = packet->cmd;
	if (packet->dir == MSPI_TX) {
		cmd.DummyCycles = dev_data->ctx.xfer.tx_dummy;
	} else {
		cmd.DummyCycles = dev_data->ctx.xfer.rx_dummy;
	}
	cmd.Address = packet->address; /* AddressSize is 32bits in OPSI mode */
	cmd.AddressWidth = mspi_stm32_xspi_psram_hal_address_size(dev_data->ctx.xfer.addr_length);
	if (cmd.DataLength == 0) {
		cmd.DataMode = HAL_XSPI_DATA_NONE;
	}

	if ((cmd.Instruction == MSPI_NOR_CMD_WREN) || (cmd.Instruction == MSPI_NOR_OCMD_WREN)) {
		/* Write Enable only accepts HAL_XSPI_ADDRESS_NONE */
		cmd.AddressMode = HAL_XSPI_ADDRESS_NONE;
	}

	hal_ret = HAL_XSPI_Command(&dev_data->hmspi.xspi, &cmd, HAL_XSPI_TIMEOUT_DEFAULT_VALUE);
	if ((hal_ret != HAL_OK) || (packet->num_bytes == 0)) {
		pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
		(void)pm_device_runtime_put(dev);
		if (hal_ret != HAL_OK) {
			LOG_ERR("Failed to send XSPI instruction");
			return -EIO;
		}
		return 0;
	}

	hal_ret = read_write_in_indirect_mode(dev, packet, access_mode);

	/* Async path: handled in ISR callback, so skip PM release here. */
	if ((hal_ret == HAL_OK) && (access_mode == MSPI_ACCESS_ASYNC)) {
		return 0;
	}

	pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
	(void)pm_device_runtime_put(dev);

	if (hal_ret != HAL_OK) {
		LOG_ERR("Failed to access data");
		return -EIO;
	}

	return 0;
}

/* Sends the command to configure the device according to the DTS */
static int mspi_stm32_xspi_psram_config_mem(const struct device *dev, uint8_t cfg_mode, uint8_t cfg_rate)
{
	struct mspi_stm32_data *dev_data = dev->data;

	/* MSPI_IO_MODE_SINGLE/MSPI_DATA_RATE_SINGLE is already done */
	/* if ((cfg_mode == MSPI_IO_MODE_SINGLE) && (cfg_rate == MSPI_DATA_RATE_SINGLE)) { */
	/* 	return 0; */
	/* } */

	/* Reconfigure the memory type of the peripheral */
	dev_data->hmspi.xspi.Init.MemoryType = HAL_XSPI_MEMTYPE_MACRONIX_RAM;
	dev_data->hmspi.xspi.Init.DelayHoldQuarterCycle = HAL_XSPI_DHQC_ENABLE;
	if (HAL_XSPI_Init(&dev_data->hmspi.xspi) != HAL_OK) {
		LOG_ERR("XSPI mem type MACRONIX_RAM failed");
		return -EIO;
	}

	LOG_DBG("XSPI flash config is OCTO / %s",
		cfg_rate == MSPI_DATA_RATE_SINGLE ? "STR" : "DTR");

	return 0;
}

static void mspi_stm32_xspi_psram_isr(const struct device *dev)
{
	struct mspi_stm32_data *dev_data = dev->data;

	HAL_XSPI_IRQHandler(&dev_data->hmspi.xspi);

	k_sem_give(&dev_data->sync);
	pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
	(void)pm_device_runtime_put(dev);
}

#if !defined(CONFIG_SOC_SERIES_STM32H7X)
/* weak function required for HAL compilation */
__weak HAL_StatusTypeDef HAL_DMA_Abort_IT(DMA_HandleTypeDef *hdma)
{
	ARG_UNUSED(hdma);
	return HAL_OK;
}

/* weak function required for HAL compilation */
__weak HAL_StatusTypeDef HAL_DMA_Abort(DMA_HandleTypeDef *hdma)
{
	ARG_UNUSED(hdma);
	return HAL_OK;
}
#endif /* !CONFIG_SOC_SERIES_STM32H7X */

#ifdef CONFIG_MSPI_DMA
static __maybe_unused void mspi_stm32_xspi_psram_dma_callback(const struct device *dev, void *arg,
							uint32_t channel, int status)
{
	DMA_HandleTypeDef *hdma = arg;

	ARG_UNUSED(dev);

	if (status < 0) {
		LOG_ERR("DMA callback error with channel %d", channel);
	}

	HAL_DMA_IRQHandler(hdma);
}
#endif

static int mspi_stm32_xspi_psram_validate_freq(uint32_t freq, uint32_t max_freq)
{
	if (freq > max_freq) {
		LOG_ERR("%u, freq is too large", __LINE__);
		return -ENOTSUP;
	}
	return 0;
}

static int mspi_stm32_xspi_psram_validate_io_mode(uint32_t io_mode)
{
	if (io_mode >= MSPI_IO_MODE_MAX) {
		LOG_ERR("%u, Invalid io_mode", __LINE__);
		return -EINVAL;
	}
	return 0;
}

static int mspi_stm32_xspi_psram_validate_data_rate(uint32_t data_rate)
{
	if (data_rate >= MSPI_DATA_RATE_MAX) {
		LOG_ERR("%u, Invalid data_rate", __LINE__);
		return -EINVAL;
	}
	return 0;
}

static int mspi_stm32_xspi_psram_validate_cpp(uint32_t cpp)
{
	if (cpp > MSPI_CPP_MODE_3) {
		LOG_ERR("%u, Invalid cpp", __LINE__);
		return -EINVAL;
	}
	return 0;
}

static int mspi_stm32_xspi_psram_validate_endian(uint32_t endian)
{
	if (endian > MSPI_XFER_BIG_ENDIAN) {
		LOG_ERR("%u, Invalid endian", __LINE__);
		return -EINVAL;
	}
	return 0;
}

static int mspi_stm32_xspi_psram_validate_ce_polarity(uint32_t ce_polarity)
{
	if (ce_polarity > MSPI_CE_ACTIVE_HIGH) {
		LOG_ERR("%u, Invalid ce_polarity", __LINE__);
		return -EINVAL;
	}
	return 0;
}

static int mspi_stm32_xspi_psram_validate_dqs(bool dqs_enable, bool dqs_support)
{
	if (dqs_enable && !dqs_support) {
		LOG_ERR("%u, DQS mode not supported", __LINE__);
		return -ENOTSUP;
	}
	return 0;
}

static int mspi_stm32_assign_cfg(struct mspi_stm32_data *data,
				 const enum mspi_dev_cfg_mask param_mask,
				 const struct mspi_dev_cfg *dev_cfg,
				 const struct mspi_stm32_conf *cfg)
{
	int ret = 0;

	if ((param_mask & MSPI_DEVICE_CONFIG_RX_DUMMY) != 0) {
		data->dev_cfg.rx_dummy = dev_cfg->rx_dummy;
	}

	if ((param_mask & MSPI_DEVICE_CONFIG_TX_DUMMY) != 0) {
		data->dev_cfg.tx_dummy = dev_cfg->tx_dummy;
	}

	if ((param_mask & MSPI_DEVICE_CONFIG_READ_CMD) != 0) {
		data->dev_cfg.read_cmd = dev_cfg->read_cmd;
	}

	if ((param_mask & MSPI_DEVICE_CONFIG_WRITE_CMD) != 0) {
		data->dev_cfg.write_cmd = dev_cfg->write_cmd;
	}

	if ((param_mask & MSPI_DEVICE_CONFIG_CMD_LEN) != 0) {
		data->dev_cfg.cmd_length = dev_cfg->cmd_length;
	}

	if ((param_mask & MSPI_DEVICE_CONFIG_ADDR_LEN) != 0) {
		data->dev_cfg.addr_length = dev_cfg->addr_length;
	}

	if ((param_mask & MSPI_DEVICE_CONFIG_MEM_BOUND) != 0) {
		data->dev_cfg.mem_boundary = dev_cfg->mem_boundary;
	}

	if ((param_mask & MSPI_DEVICE_CONFIG_BREAK_TIME) != 0) {
		data->dev_cfg.time_to_break = dev_cfg->time_to_break;
	}
	if ((param_mask & MSPI_DEVICE_CONFIG_CE_POL) != 0) {
		ret = mspi_stm32_xspi_psram_validate_ce_polarity(dev_cfg->ce_polarity);
		if (ret != 0) {
			goto end;
		}
		data->dev_cfg.ce_polarity = dev_cfg->ce_polarity;
	}

