endresshauser-lp/zephyr/drivers/mspi/mspi_stm32_xspi_psram.c
	if (xfer->num_packet == 0 || xfer->packets == NULL ||
	    xfer->timeout > CONFIG_MSPI_COMPLETION_TIMEOUT_TOLERANCE) {
		LOG_ERR("Transfer: wrong parameters");
		return -EFAULT;
	}

	ret = mspi_stm32_xspi_psram_context_lock(ctx, xfer);
	if (ret != 0) {
		LOG_ERR("Failed to lock MSPI context");
		return ret;
	}

	while (ctx->packets_left > 0) {
		packet_idx = ctx->xfer.num_packet - ctx->packets_left;
		packet = (const struct mspi_xfer_packet *)&ctx->xfer.packets[packet_idx];
#ifdef CONFIG_MSPI_DMA
		const struct mspi_stm32_conf *dev_cfg = controller->config;

		if (dev_cfg->dma_specified) {
			ret = mspi_stm32_xspi_psram_access(controller, packet, MSPI_ACCESS_DMA);
		} else {
			LOG_ERR("DMA configuration is missing from the device tree");
			ret = -EIO;
			goto end;
		}
#else
		ret = mspi_stm32_xspi_psram_access(controller, packet,
					     ctx->xfer.async ? MSPI_ACCESS_ASYNC :
							       MSPI_ACCESS_SYNC);
#endif

		ctx->packets_left--;
		if (ret != 0) {
			ret = -EIO;
			goto end;
		}
	}

end:
	mspi_stm32_xspi_psram_context_unlock(ctx);
	return ret;
}

/**
 * API implementation of mspi_transceive.
 *
 * @param controller Pointer to the device structure for the driver instance.
 * @param dev_id Pointer to the device ID structure from a device.
 * @param xfer Pointer to the MSPI transfer started by dev_id.
 *
 * @retval 0 if successful.
 * @retval A negative errno value upon failure.
 */
static int mspi_stm32_xspi_psram_transceive(const struct device *controller,
				      const struct mspi_dev_id *dev_id,
				      const struct mspi_xfer *xfer)
{
	int ret = 0;
	struct mspi_stm32_data *dev_data = controller->data;

	if (dev_id != dev_data->dev_id) {
		LOG_ERR("transceive : dev_id don't match");
		return -ESTALE;
	}

	/* Need to map the xfer to the data context */
	dev_data->ctx.xfer = *xfer;
    ret = mspi_stm32_xspi_psram_pio_dma_transceive(controller, xfer);

	return ret;
}

static int mspi_stm32_xspi_psram_dma_init(DMA_HandleTypeDef *hdma, struct stm32_stream *dma_stream)
{
	int ret;
	/*
	 * DMA configuration
	 * Due to use of XSPI HAL API in current driver,
	 * both HAL and Zephyr DMA drivers should be configured.
	 * The required configuration for Zephyr DMA driver should only provide
	 * the minimum information to inform the DMA slot will be in used and
	 * how to route callbacks.
	 */

	if (!device_is_ready(dma_stream->dev)) {
		LOG_ERR("DMA %s device not ready", dma_stream->dev->name);
		return -ENODEV;
	}

	dma_stream->cfg.user_data = hdma;
	/* This field is used to inform driver that it is overridden */
	dma_stream->cfg.linked_channel = STM32_DMA_HAL_OVERRIDE;
	ret = dma_config(dma_stream->dev, dma_stream->channel, &dma_stream->cfg);
	if (ret != 0) {
		LOG_ERR("Failed to configure DMA channel %d", dma_stream->channel);
		return ret;
	}

	/* Proceed to the HAL DMA driver init */
	if (dma_stream->cfg.source_data_size != dma_stream->cfg.dest_data_size) {
		LOG_ERR("DMA Source and destination data sizes not aligned");
		return -EINVAL;
	}

	hdma->Init.SrcDataWidth = DMA_SRC_DATAWIDTH_BYTE;
	hdma->Init.DestDataWidth = DMA_DEST_DATAWIDTH_BYTE;
	hdma->Init.SrcInc =
		(dma_stream->src_addr_increment) ? DMA_SINC_INCREMENTED : DMA_SINC_FIXED;
	hdma->Init.DestInc =
		(dma_stream->dst_addr_increment) ? DMA_DINC_INCREMENTED : DMA_DINC_FIXED;
	hdma->Init.SrcBurstLength = 4;
	hdma->Init.DestBurstLength = 4;
	hdma->Init.Priority = mspi_stm32_table_priority[dma_stream->cfg.channel_priority];
	hdma->Init.Direction = mspi_stm32_table_direction[dma_stream->cfg.channel_direction];
	hdma->Init.TransferAllocatedPort = DMA_SRC_ALLOCATED_PORT0 | DMA_SRC_ALLOCATED_PORT1;
	hdma->Init.TransferEventMode = DMA_TCEM_BLOCK_TRANSFER;
	hdma->Init.Mode = DMA_NORMAL;
	hdma->Init.BlkHWRequest = DMA_BREQ_SINGLE_BURST;
	hdma->Init.Request = dma_stream->cfg.dma_slot;

	/*
	 * HAL expects a valid DMA channel.
	 * The channel is from 0 to 7 because of the STM32_DMA_STREAM_OFFSET
	 * in the dma_stm32 driver
	 */
	hdma->Instance = LL_DMA_GET_CHANNEL_INSTANCE(dma_stream->reg, dma_stream->channel);

	/* Initialize DMA HAL */
	if (HAL_DMA_Init(hdma) != HAL_OK) {
		LOG_ERR("XSPI DMA Init failed");
		return -EIO;
	}

	if (HAL_DMA_ConfigChannelAttributes(hdma, DMA_CHANNEL_NPRIV) != HAL_OK) {
		LOG_ERR("XSPI DMA Init failed");
		return -EIO;
	}

	LOG_DBG("XSPI with DMA transfer");
	return 0;
}

static int mspi_validate_config(const struct mspi_cfg *config, uint32_t max_frequency)
{
	if (config->op_mode != MSPI_OP_MODE_CONTROLLER) {
		LOG_ERR("Only support MSPI controller mode");
		return -ENOTSUP;
	}

	if (config->max_freq > max_frequency) {
		LOG_ERR("Max_freq %d too large", config->max_freq);
		return -ENOTSUP;
	}

	if (config->duplex != MSPI_HALF_DUPLEX) {
		LOG_ERR("Only support half duplex mode");
		return -ENOTSUP;
	}

	if (config->num_periph > MSPI_MAX_DEVICE) {
		LOG_ERR("Invalid MSPI peripheral number");
		return -ENOTSUP;
	}

	return 0;
}

static int mspi_stm32_xspi_psram_activate(const struct device *dev)
{
	int ret;
	const struct mspi_stm32_conf *config = (struct mspi_stm32_conf *)dev->config;
	const struct device *const clk = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);

	if (!device_is_ready(clk)) {
		return -ENODEV;
	}

	ret = pinctrl_apply_state(config->pcfg, PINCTRL_STATE_DEFAULT);
	if (ret < 0) {
		return ret;
	}

	if (clock_control_on(clk, (clock_control_subsys_t)(uintptr_t)&config->pclken[0]) != 0) {
		return -EIO;
	}

	return 0;
}

static int mspi_hal_init(const struct mspi_stm32_conf *dev_cfg, struct mspi_stm32_data *dev_data,
			 uint32_t ahb_clock_freq)
{
	uint32_t prescaler = MSPI_STM32_CLOCK_PRESCALER_MIN;

	for (; prescaler <= MSPI_STM32_CLOCK_PRESCALER_MAX; prescaler++) {
		dev_data->dev_cfg.freq = MSPI_STM32_CLOCK_COMPUTE(ahb_clock_freq, prescaler);
		if (dev_data->dev_cfg.freq <= dev_cfg->mspicfg.max_freq) {
			break;
		}
	}
	__ASSERT_NO_MSG(prescaler <= MSPI_STM32_CLOCK_PRESCALER_MAX);

	dev_data->hmspi.xspi.Init.ClockPrescaler = prescaler;
	dev_data->hmspi.xspi.Init.WrapSize = HAL_XSPI_WRAP_32_BYTES;

