endresshauser-lp/zephyr/drivers/mspi/mspi_stm32_xspi_psram.c
	if (dev_data->dev_cfg.data_rate != MSPI_DATA_RATE_SINGLE) {
		dev_data->hmspi.xspi.Init.MemoryType = HAL_XSPI_MEMTYPE_MACRONIX_RAM;
		dev_data->hmspi.xspi.Init.DelayHoldQuarterCycle = HAL_XSPI_DHQC_ENABLE;
	} else {
		dev_data->hmspi.xspi.Init.MemoryType = HAL_XSPI_MEMTYPE_MICRON;
		dev_data->hmspi.xspi.Init.DelayHoldQuarterCycle = HAL_XSPI_DHQC_DISABLE;
	}

	dev_data->hmspi.xspi.Init.DelayBlockBypass = HAL_XSPI_DELAY_BLOCK_ON;

	if (HAL_XSPI_Init(&dev_data->hmspi.xspi) != HAL_OK) {
		LOG_ERR("MSPI Init failed");
		return -EIO;
	}

	LOG_DBG("MSPI Init'd");
	return 0;
}

static __maybe_unused int mspi_dma_setup(const struct mspi_stm32_conf *dev_cfg,
					 struct mspi_stm32_data *dev_data)
{
	if (!dev_cfg->dma_specified) {
		LOG_ERR("DMA configuration is missing from the device tree");
		return -EIO;
	}

	if (mspi_stm32_xspi_psram_dma_init(&dev_data->hdma_tx, &dev_data->dma_tx) != 0) {
		LOG_ERR("XSPI DMA Tx init failed");
		return -EIO;
	}
	__HAL_LINKDMA(&dev_data->hmspi.xspi, hdmatx, dev_data->hdma_tx);

	if (mspi_stm32_xspi_psram_dma_init(&dev_data->hdma_rx, &dev_data->dma_rx) != 0) {
		LOG_ERR("XSPI DMA Rx init failed");
		return -EIO;
	}
	__HAL_LINKDMA(&dev_data->hmspi.xspi, hdmarx, dev_data->hdma_rx);

	return 0;
}

/**
 * API implementation of mspi_config : controller configuration.
 *
 * @param spec Pointer to MSPI device tree spec.
 * @return 0 if successful.
 * @return A negative errno value upon failure.
 */
static int mspi_stm32_xspi_psram_config(const struct mspi_dt_spec *spec)
{
	int ret;
	const struct mspi_cfg *config = &spec->config;
	const struct mspi_stm32_conf *dev_cfg = spec->bus->config;
	struct mspi_stm32_data *dev_data = spec->bus->data;
	uint32_t ahb_clock_freq;

	ret = mspi_validate_config(config, dev_cfg->mspicfg.max_freq);
	if (ret != 0) {
		return ret;
	}

	(void)pm_device_runtime_get(spec->bus);
	/* Prevent the clocks to be stopped during the request */
	pm_policy_state_lock_get(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);

	/* pinctrl */
	ret = pinctrl_apply_state(dev_cfg->pcfg, PINCTRL_STATE_DEFAULT);
	if (ret < 0) {
		LOG_ERR("MSPI pinctrl setup failed");
		goto end;
	}

	if (dev_data->dev_cfg.dqs_enable && !dev_cfg->mspicfg.dqs_support) {
		LOG_ERR("MSPI dqs mismatch (not supported but enabled)");
		ret = -ENOTSUP;
		goto end;
	}

	dev_cfg->irq_config();

	ret = mspi_stm32_xspi_psram_activate(spec->bus);
	if (ret != 0) {
		goto end;
	}

	if (clock_control_get_rate(DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE),
				   (clock_control_subsys_t)&dev_cfg->pclken[0],
				   &ahb_clock_freq) < 0) {
		LOG_ERR("Failed call clock_control_get_rate(pclken)");
		ret = -EIO;
		goto end;
	}

	ret = mspi_hal_init(dev_cfg, dev_data, ahb_clock_freq);
	if (ret != 0) {
		goto end;
	}

#if defined(HAL_XSPIM_IOPORT_1) || defined(HAL_XSPIM_IOPORT_2)
	/* XSPI I/O manager config */
	XSPIM_CfgTypeDef mspi_mgr_cfg;

	if (dev_data->hmspi.xspi.Instance == XSPI1) {
		mspi_mgr_cfg.IOPort = HAL_XSPIM_IOPORT_1;
	}
	if (dev_data->hmspi.xspi.Instance == XSPI2) {
		mspi_mgr_cfg.IOPort = HAL_XSPIM_IOPORT_2;
	}
	mspi_mgr_cfg.nCSOverride = HAL_XSPI_CSSEL_OVR_DISABLED;
	mspi_mgr_cfg.Req2AckTime = 1;
	if (HAL_XSPIM_Config(&dev_data->hmspi.xspi, &mspi_mgr_cfg,
			     HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
		LOG_ERR("XSPI M config failed");
		ret = -EIO;
		goto end;
	}
#endif

#if defined(DLYB_XSPI1) || defined(DLYB_XSPI2) || defined(DLYB_OCTOSPI1) || defined(DLYB_OCTOSPI2)
	HAL_XSPI_DLYB_CfgTypeDef mspi_delay_block_cfg = {0};

	(void)HAL_XSPI_DLYB_GetClockPeriod(&dev_data->hmspi.xspi, &mspi_delay_block_cfg);
	mspi_delay_block_cfg.PhaseSel /= 4;
	if (HAL_XSPI_DLYB_SetConfig(&dev_data->hmspi.xspi, &mspi_delay_block_cfg) != HAL_OK) {
		LOG_ERR("XSPI DelayBlock failed");
		ret = -EIO;
		goto end;
	}
	LOG_DBG("Delay Block Init");
#endif

#ifdef CONFIG_MSPI_DMA
	ret = mspi_dma_setup(dev_cfg, dev_data);
	if (ret != 0) {
		goto end;
	}
#endif

	if (k_sem_count_get(&dev_data->ctx.lock) == 0) {
		k_sem_give(&dev_data->ctx.lock);
	}
	if (config->re_init) {
		k_mutex_unlock(&dev_data->lock);
	}

end:
	pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
	(void)pm_device_runtime_put(spec->bus);

	if (ret == 0) {
		LOG_INF("MSPI configured");
	} else {
		LOG_ERR("MSPI not configured: %d", ret);
    }

	return ret;
}

/**
 * Set up and config a new controller.
 *
 * @param dev MSPI controller.
 *
 * @retval 0 if successful.
 */
static int mspi_stm32_init(const struct device *controller)
{
	const struct mspi_stm32_conf *cfg = controller->config;
	const struct mspi_dt_spec spec = {
		.bus = controller,
		.config = cfg->mspicfg,
	};

	return mspi_stm32_xspi_psram_config(&spec);
}

static DEVICE_API(mspi, mspi_stm32_driver_api) = {
	.config = mspi_stm32_xspi_psram_config,
	.dev_config = mspi_stm32_xspi_psram_dev_config,
	.xip_config = mspi_stm32_xspi_psram_xip_config,
	.get_channel_status = mspi_stm32_xspi_psram_get_channel_status,
	.transceive = mspi_stm32_xspi_psram_transceive,
};

#ifdef CONFIG_PM_DEVICE
static int mspi_stm32_xspi_psram_suspend(const struct device *dev)
{
	int ret;
	const struct mspi_stm32_conf *cfg = (struct mspi_stm32_conf *)dev->config;
	const struct device *const clk = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);

	/* Disable device clock. */
	ret = clock_control_off(clk, (clock_control_subsys_t)(uintptr_t)&cfg->pclken[0]);
	if (ret < 0) {
		LOG_ERR("Failed to disable MSPI clock during PM suspend process");
		return ret;
	}

	/* Move pins to sleep state */
	ret = pinctrl_apply_state(cfg->pcfg, PINCTRL_STATE_SLEEP);
	if (ret == -ENOENT) {
		/* Warn but don't block suspend */
		LOG_WRN_ONCE("MSPI pinctrl sleep state not available");
		return 0;
	}

	return ret;
}

static int mspi_stm32_xspi_psram_pm_action(const struct device *dev, enum pm_device_action action)
{
	switch (action) {
	case PM_DEVICE_ACTION_RESUME:
		return mspi_stm32_xspi_psram_activate(dev);
	case PM_DEVICE_ACTION_SUSPEND:
		return mspi_stm32_xspi_psram_suspend(dev);
	default:
		return -ENOTSUP;
	}
}
#endif /* CONFIG_PM_DEVICE */

void HAL_XSPI_TimeOutCallback(XSPI_HandleTypeDef *hxspi)
{
    printk("in a timeout!\n");
}

void HAL_XSPI_ErrorCallback(XSPI_HandleTypeDef *hxspi)
{
    printk("in an error!\n");
}

